app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(id: "DESC")
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC

  def create
    post = Post.create(content: params[:content], checked: false)
---
INSERT INTO `posts` (`content`, `checked`, `created_at`, `updated_at`) VALUES ('az', FALSE, '2020-07-23 05:31:34.888843', '2020-07-23 05:31:34.888843')

  def checked
    post = Post.find(params[:id])
    if post.checked
      post.update(checked: false)
    else
      post.update(checked: true)
    end
    item = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
UPDATE `posts` SET `posts`.`checked` = FALSE, `posts`.`updated_at` = '2020-07-23 03:10:02.000208' WHERE `posts`.`id` = 3
UPDATE `posts` SET `posts`.`checked` = TRUE, `posts`.`updated_at` = '2020-07-23 03:09:59.690136' WHERE `posts`.`id` = 3